# YOLOv12-DMMA-MS 🚀, AGPL-3.0 license
# Multi-scale DMMA + improved ECA for small-vessel detection.

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants, i.e. 'model=yolov12-dmma-ms-n.yaml'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 6 MS-DMMA encoder
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 8 MS-DMMA encoder

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 11 (P4-head, shift enabled, mlp=2.0)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C2fDMMA, [256, [2, 4], 8, True, 2.0]]  # 14 (P3/8-small, smaller windows [2,4] for small targets)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 17 (P4/16-medium, shift enabled, mlp=2.0)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)
