# YOLOv12-DMMA-P2-Ultimate
# AGPL-3.0 license
# Ultimate version with full DASA (Dynamic Area Self-Attention) + SAQK-Mask
#
# Key innovations from report:
#   1. DASA: Density-driven dynamic window size selection
#   2. SAQK-Mask: Scale-aware Q-K dynamic masking (boost small-target queries)
#   3. SPPF for multi-scale feature fusion
#   4. All heads use SW-MSA (shifted window)
#
# Target improvements:
#   - mAP50: 0.809 -> 0.87+
#   - mAP50-95: 0.331 -> 0.42+
#   - Recall: 0.723 -> 0.82+
#   - Precision: 0.818 -> 0.88+

# Parameters
nc: 1  # MASATI single class: ship
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with SPPF + Density-aware DMMA (DASA-style)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 backbone feature
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 backbone feature
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 6 MS-DMMA P4 with density gate
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]  # 8 SPPF for multi-scale fusion
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 9 MS-DMMA P5

# Head with SAQK-Mask enhanced DMMA for small target detection
# SAQK scale_factor: smaller value = shallower layer = MORE boost
# P2(stride=4), P3(stride=8), P4(stride=16) -> scale_factor=4,8,16
head:
  # === Top-down path with SAQK-Mask ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  # C2fDMMA_SAQK args: [out_ch, window_size, heads, shift, mlp_ratio, scale_factor]
  - [-1, 2, C2fDMMA_SAQK, [512, [4, 8], 8, True, 2.0, 16]]  # 12 P4 scale=16

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 2, C2fDMMA_SAQK, [256, [2, 4], 8, True, 2.5, 8]]  # 15 P3 scale=8 (more boost)

  # P3 -> P2 (Critical for tiny ship detection)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2
  - [-1, 2, C2fDMMA_SAQK, [128, 4, 8, True, 2.0, 4]]  # 18 P2 scale=4 (max boost)

  # === Bottom-up path (standard DMMA with density gate) ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20 cat P3 top-down
  - [-1, 2, C2fDMMA, [256, [2, 4], 8, True, 2.0]]  # 21 P3 output

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23 cat P4 top-down
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 24 P4 output

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]  # 26 cat backbone P5
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 27 P5 output (MS-DMMA)

  # Detect on P2, P3, P4, P5 (4-scale comprehensive detection)
  - [[18, 21, 24, 27], 1, Detect, [nc]]
