# YOLOv12-DMMA-P2-Lite 🚀, AGPL-3.0 license
# Memory-optimized P2 detection head version
# Optimizations:
# 1. P2 layer uses C3k2 instead of C2fDMMA to reduce VRAM
# 2. Smaller window sizes and reduced mlp_ratio
# 3. Compatible with batch=24 on RTX 4090

# Parameters
nc: 1  # MASATI single class: ship
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 backbone feature
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 backbone feature
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 6 MS-DMMA P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 8 MS-DMMA P5

# Head with P2 detection (memory-optimized)
head:
  # === Top-down path ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 9
  - [[-1, 6], 1, Concat, [1]]  # 10 cat backbone P4
  - [-1, 2, C2fDMMA, [512, 8, 8, True, 2.0]]  # 11 P4 (single-scale window)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 4], 1, Concat, [1]]  # 13 cat backbone P3
  - [-1, 2, C2fDMMA, [256, 4, 8, True, 2.0]]  # 14 P3 (window=4 for small targets)

  # P3 -> P2 (use C3k2 instead of C2fDMMA to save VRAM)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 2], 1, Concat, [1]]  # 16 cat backbone P2
  - [-1, 2, C3k2, [128, False, 0.25]]  # 17 P2 - C3k2 is more memory efficient

  # === Bottom-up path ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]  # 18
  - [[-1, 14], 1, Concat, [1]]  # 19 cat P3 top-down
  - [-1, 2, C3k2, [256, False, 0.25]]  # 20 P3 output

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 21
  - [[-1, 11], 1, Concat, [1]]  # 22 cat P4 top-down
  - [-1, 2, C2fDMMA, [512, 8, 8, True, 2.0]]  # 23 P4 output

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 24
  - [[-1, 8], 1, Concat, [1]]  # 25 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]  # 26 P5 output

  # Detect on P2, P3, P4, P5
  - [[17, 20, 23, 26], 1, Detect, [nc]]
