# YOLOv12-DMMA-P2-Advanced
# AGPL-3.0 license
# Advanced version with optimized DMMA, SPPF, and enhanced attention for small ship detection
#
# Key improvements:
#   1. Multi-scale windows ([4,8], [8,16]) for better scale coverage
#   2. Shifted Window (SW-MSA) enabled in all head layers
#   3. SPPF layer for multi-scale feature fusion
#   4. Increased mlp_ratio for P2/P3 layers (small target enhancement)
#   5. Higher num_heads at P2 for fine-grained attention

# Parameters
nc: 1  # MASATI single class: ship
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with enhanced DMMA + SPPF
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 backbone feature
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 backbone feature
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 6 MS-DMMA P4 (multi-scale + shift)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]  # 8 SPPF for multi-scale feature fusion
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 9 MS-DMMA P5 (large windows)

# Head with P2 detection - Enhanced with SW-MSA and optimized mlp_ratio
head:
  # === Top-down path ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 12 P4 fusion (MS-DMMA + shift)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 2, C2fDMMA, [256, [2, 4], 8, True, 2.5]]  # 15 P3 fusion (small windows, high mlp)

  # P3 -> P2 (Key for tiny ship detection)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2
  - [-1, 2, C2fDMMA, [128, 4, 8, True, 2.0]]  # 18 P2 fusion (8 heads, shift, mlp=2.0)

  # === Bottom-up path ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20 cat P3 top-down
  - [-1, 2, C2fDMMA, [256, [2, 4], 8, True, 2.0]]  # 21 P3 output (MS-DMMA)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23 cat P4 top-down
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 24 P4 output (MS-DMMA)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]  # 26 cat backbone P5
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 27 P5 output (MS-DMMA)

  # Detect on P2, P3, P4, P5 (4-scale detection for comprehensive coverage)
  - [[18, 21, 24, 27], 1, Detect, [nc]]
