# YOLOv12-DMMA-P2-DASA
# AGPL-3.0 license
# DASA (Dynamic Area Self-Attention) version
# Uses density-driven dynamic window size selection
# Key idea: high-density regions get larger windows, low-density regions get smaller windows
#
# For ablation study: compare with yolov12-dmma-p2-advanced.yaml (static gates)

# Parameters
nc: 1  # MASATI single class: ship
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with standard C3k2 + SPPF
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 backbone
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 backbone
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 6 MS-DMMA P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]  # 8 SPPF
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 9 MS-DMMA P5

# Head with DASA (Dynamic Area Self-Attention) - density-driven window selection
head:
  # === Top-down path with DASA ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  # C2fDASA args: [out_channels, window_sizes, density_thresholds, num_heads, mlp_ratio]
  - [-1, 1, C2fDASA, [512, [4, 8, 16], [0.3, 0.7], 8, 2.0]]  # 12 DASA P4

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 1, C2fDASA, [256, [2, 4, 8], [0.3, 0.7], 8, 2.5]]  # 15 DASA P3 (smaller windows)

  # P3 -> P2 (Key for tiny targets)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2
  - [-1, 1, C2fDASA, [128, [2, 4, 8], [0.25, 0.65], 4, 2.0]]  # 18 DASA P2

  # === Bottom-up path (standard MS-DMMA) ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20 cat P3 top-down
  - [-1, 2, C2fDMMA, [256, [2, 4], 8, True, 2.0]]  # 21 P3 output

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23 cat P4 top-down
  - [-1, 2, C2fDMMA, [512, [4, 8], 8, True, 2.0]]  # 24 P4 output

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]  # 26 cat backbone P5
  - [-1, 2, C2fDMMA, [1024, [8, 16], 8, True, 2.0]]  # 27 P5 output

  # Detect on P2, P3, P4, P5
  - [[18, 21, 24, 27], 1, Detect, [nc]]
